**复习：**在前面我们已经学习了Pandas基础，第二章我们开始进入数据分析的业务部分，在第二章第一节的内容中，我们学习了**数据的清洗**，这一部分十分重要，只有数据变得相对干净，我们之后对数据的分析才可以更有力。而这一节，我们要做的是数据重构，数据重构依旧属于数据理解（准备）的范围。

#### 开始之前，导入numpy、pandas包和数据

In [1]:
# 导入基本库
import numpy as np
import pandas as pd

In [2]:
# 载入上一个任务人保存的文件中:result.csv，并查看这个文件
result = pd.read_csv("result.csv")
result

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,447,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,448,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,449,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,450,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,451,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

# 2 第二章：数据重构

## 第一部分：数据聚合与运算

### 2.6 数据运用

#### 2.6.1 任务一：通过教材《Python for Data Analysis》P303、Google or anything来学习了解GroupBy机制

In [5]:
#写入心得
使用groupby分组，可以得到一个DataFrameGroupBy对象

对DataFrameGroupBy对象使用 get_group() 方法，能够让我们得到分组元素中的指定组的数据 # df.get_group('col')

1、对单个列进行聚合操作，比如：我们想对Age列求总和sum：
df.groupby("Sex")["Age"].sum
df.groupby("Sex").agg({"Age":"sum"})

2、索引重置 .reset_index() （见之前课件）

3、对多个列使用不同的聚合函数，比如：我们想对Age求和、对Fare求均值
df.groupby("Sex").agg({"Age":"sum","Fare":"mean"})

4、rename：对生成的列名进行修改

.
.
.

#更多的知识可以查看该链接 https://zhuanlan.zhihu.com/p/384256189

#### 2.4.2：任务二：计算泰坦尼克号男性与女性的平均票价

In [8]:
# 写入代码
mean_fare = result.groupby("Sex").agg({"Fare":"mean"})
mean_fare

             Fare
Sex
female  44.479818
male    25.523893

在了解GroupBy机制之后，运用这个机制完成一系列的操作，来达到我们的目的。

下面通过几个任务来熟悉GroupBy机制。

#### 2.4.3：任务三：统计泰坦尼克号中男女的存活人数

In [11]:
# 写入代码
Survived = result.groupby("Sex").agg({"Survived":"sum"})
Survived

        Survived
Sex
female       233
male         109

#### 2.4.4：任务四：计算客舱不同等级的存活人数

In [10]:
# 写入代码
Survived_P = result.groupby("Pclass").agg({"Survived":"sum"})
Survived_P

        Survived
Pclass
1            136
2             87
3            119

【**提示：**】表中的存活那一栏，可以发现如果还活着记为1，死亡记为0

【**思考**】从数据分析的角度，上面的统计结果可以得出那些结论

In [12]:
#思考心得 
#下面表示的是对Fare分别求和、最大值、最小值、均值、个数（size）
Fare_All = result.groupby("Sex")["Fare"].agg(["sum","max","min","mean","size"]).reset_index()
Fare_All

      Sex         sum       max   min       mean  size
0  female  13966.6628  512.3292  6.75  44.479818   314
1    male  14727.2865  512.3292  0.00  25.523893   577

【思考】从任务二到任务三中，这些运算可以通过agg()函数来同时计算。并且可以使用rename函数修改列名。你可以按照提示写出这个过程吗？

In [13]:
#思考心得
meanfare_sumsurvived = result.groupby("Sex").agg({"Fare":"mean","Survived":"sum"}).rename(columns={"Fare":"Fare_mean","Survived":"Survived_sum"})
meanfare_sumsurvived

        Fare_mean  Survived_sum
Sex
female  44.479818           233
male    25.523893           109

#### 2.4.5：任务五：统计在不同等级的票中的不同年龄的船票花费的平均值

In [15]:
# 写入代码
PclassAgeFare = result.groupby(["Pclass", "Age"]).agg({"Fare":"mean"})
PclassAgeFare

                  Fare
Pclass Age
1      0.92   151.5500
       2.00   151.5500
       4.00    81.8583
       11.00  120.0000
       14.00  120.0000
...                ...
3      61.00    6.2375
       63.00    9.5875
       65.00    7.7500
       70.50    7.7500
       74.00    7.7750

[182 rows x 1 columns]

#### 2.4.6：任务六：将任务二和任务三的数据合并，并保存到sex_fare_survived.csv

In [16]:
# 写入代码
sex_fare_survived = pd.merge(mean_fare,Survived,on='Sex')
sex_fare_survived.to_csv("sex_fare_survived.csv")
sex_fare_survived

             Fare  Survived
Sex
female  44.479818       233
male    25.523893       109

#### 2.4.7：任务七：得出不同年龄的总的存活人数，然后找出存活人数最多的年龄段，最后计算存活人数最高的存活率（存活人数/总人数）

In [25]:
# 写入代码
Age_Survived = result.groupby("Age").agg({"Survived":"sum"})
Age_Survived

       Survived
Age
0.42          1
0.67          1
0.75          2
0.83          2
0.92          1
...         ...
70.00         0
70.50         0
71.00         0
74.00         0
80.00         1

[88 rows x 1 columns]

In [29]:
# 写入代码
val = Age_Survived.max()
print(val)

Survived    15
dtype: int64

In [30]:
# 写入代码
Sur = result['Survived'].sum()
print(Sur)

342

In [31]:
# 写入代码
per = val / Sur
print(per)

Survived    0.04386
dtype: float64